%AMPLITUDE SHIFT KEYING
b=[0 1 0 1 1 1 0];
n=length(b);
t=0:.01:n; %০ থেকে n পর্যন্ত ০.০১ ইন্টারভালে মান তৈরি করে।

for i =1:n
bw(i*100:(i+1)*100)=b(i); %প্রতিটি বিটকে ১০০টি স্যাম্পলে রূপান্তর করে প্রসারিত করে।
                          %যদি b(i)=1, তখন bw তে ১০০টি ১ বসানো হবে।
                          %যদি b(i)=0, তখন ১০০টি ০ বসানো হবে।
end
bw=bw(100:end); %বাইনারি সিগনালের শুরুতে অপ্রয়োজনীয় ১০০টি মান বাদ দেয়।

sint=sin(2*pi*t); %একটি সাইন ওয়েভ তৈরি করে। Known as Carrier Signal
st=bw.*sint; % বাইনারি সিগনালকে সাইন ওয়েভের সাথে গুণ করে।
             % bw=1 → সাইন ওয়েভ পাবে।

%subplot(m, n, p) এর মানে:
%m = কত লাইন হবে।
%n = কত কলাম হবে।
%p = কোন ঘরে প্লট করবে (বাম থেকে ডানে, উপর থেকে নিচে)।

subplot(3,3,1); %৩x৩ গ্রিডের ১ নম্বর ঘরে প্লট বসায়।
plot(t,bw) %বাইনারি সিগনাল বনাম সময় প্লট (figure)করে।
grid on; %গ্রিড লাইন যোগ করে (পড়তে সহজ হয়)।
axis([0 n -2 2]) %x-axis: ০ থেকে n পর্যন্ত। y-axis: -২ থেকে +২ পর্যন্ত।
title("Binary Wave Signal");

subplot(3,3,2) %৩x৩ গ্রিডের 2 নম্বর ঘরে প্লট বসায়।
plot(t,sint) %সাইন ওয়েভ (ক্যারিয়ার) প্লট।
grid on;
axis([0 n -2 2])
title("Career Sine Wave")

subplot(3,3,3)
plot(t,st) %৩ নম্বর ঘরে মডুলেটেড (ASK) সিগনাল প্লট করে।
grid on;
axis([0 n -2 2])
title("Amplitude Shift Keying")

