
b = input('Enter the binary sequence as a vector: ');   

%এখন ইউজার ইনপুট দিলে, MATLAB সেটাকে একটি অ্যারে হিসেবে নিবে।
%ইউজার যদি কনসোলে টাইপ করে: [0 1 0 1 1 1 0] 
%তাহলে b এর মান সেট হবে: b =  0 1 0 1 1 1 0

%কখনো কখনো ইউজার স্পেস ছাড়া 0101110 এর মতো ইনপুট দিতে পারে।
%তখন স্ট্রিং ইনপুট নিয়ে সেটাকে ভেক্টরে কনভার্ট করা লাগে।

str = input('Enter the binary sequence: ', 's');  % 's' মানে স্ট্রিং ইনপুট
b = str - '0';  % স্ট্রিং থেকে সংখ্যা ভেক্টরে কনভার্ট করা

%ইউজার ইনপুট দিল 0101110 (স্ট্রিং)।
%str - '0' মানে ASCII কোড অনুযায়ী ০,১ গুলো আসল সংখ্যা হয়ে যাবে!
